classes/programming-101-introduction-to-python/index.org
* Programming 101: Introduction to Python

  Welcome to *NSL 3.0's* class *Programming 101: Introduction to Python* where you, the aspiring Python Hacker will watch, learn, and do in your quest to create.

  This is a beginner's introduction but hopefully you at least have a copy of [[http://python.org/download/][Python]] *version 3* available to you and an editor of some kind (for later).

  This class is interactive and you should feel free to follow along in your own environments and ask questions whenever you need -- others probably have the same questions, so be brave!

** How to Python

   On most systems once you have Python installed you can start a *Python Shell* from any terminal or run bar by invoking =python=.  In some instances, this will open an [[https://docs.python.org/2/library/idle.html][IDLE]] shell.

   #+CAPTION: Starting Python from a Unix shell
   #+BEGIN_EXAMPLE
   $ python3
   Python 3.6.1 (default, Jul 13 2017, 01:14:50)
   [GCC 4.2.1 Compatible FreeBSD Clang 3.4.1 (tags/RELEASE_34/dot1-final 208032)] on freebsd10
   Type "help", "copyright", "credits" or "license" for more information.
   >>>
   #+END_EXAMPLE

   #+CAPTION: Starting Python from Powershell on Windows
   #+BEGIN_EXAMPLE
   PS C:\Users\merlin> python
   Python 3.6.1 (v3.6.1:69c0db5, Mar 21 2017, 18:41:36) [MSC v.1900 64 bit (AMD64)] on win32
   Type "help", "copyright", "credits" or "license" for more information.
   >>>
   #+END_EXAMPLE

** Further resources

   - [[http://docs.python.org/3/tutorial/][Python 3 Documentation: Tutorial]]
   - [[https://docs.python.org/3/library/idle.html][Python 3 Documentation: IDLE]]
   - [[http://www.codecademy.com/tracks/python][Python course at Codecademy]]
   - [[http://learnpython.org][Python course at LearnPython]]

* Why Python is BALLER

** Pros

   - Frontend to C :: Almost all of the power of C without as many rituals or foot-guns -- unless you get into *CPython*, then you get it all
   - Embedability :: Almost everything can run Python since it is basically C underneath; [[https://www.raspberrypi.org/documentation/usage/python/][Raspberry-Pi]] is famous for its Python integration
   - Writeability :: Easy to write most things with at least one obvious way to do anything
   - Readability :: Easy to read most code later, especially if it follows the *Zen of Python*
   - Discoverability :: Easy to learn about things within the language and online with tons of third party libraries
   - Recyclability :: Quick to keep iterating and refactoring upon ideas
   - Portability :: Same code works on quite a number of processor architectures and is available for quite a lot of operating systems
   - Lingua Franca :: People from many walks of life and domains of knowledge know and use Python
   - Spider Python :: Very Web friendly both as a consumer and a producer
   - Prototyping :: Quick to get started with just about anything thanks to all of the above

** Neutral

   - No Braces :: One less braceface in the world of programming
   - BDFL :: [[https://gvanrossum.github.io][Guido Van Rossum]], *Benevolent Dictator For Life*
   - Dynamic Ducks :: [[https://en.wikipedia.org/wiki/Type_system#Dynamic_type_checking_and_runtime_type_information][Dynamic Typing]] lends itself to some of the *pros* _and_ some of the *cons*, but it is just a fact of the language
   - Static Stoics :: [[https://docs.python.org/3/library/typing.html][Type Hints]] are available since *Python 3.5* and there is the [[http://mypy-lang.org][mypy static type checker]]

** Cons

   - FIOC :: Forced Indentation of Code
   - GIL :: [[https://wiki.python.org/moin/GlobalInterpreterLock][Global Interpreter Lock]]
   - [[http://benchmarksgame.alioth.debian.org/u64q/python.html][Expensive in Memory and CPU]] :: In part due to the above but also as a consequence of other language design and implementation choices
   - Exceptional :: Exceptions have some benefits but they are, ultimately, [[https://homepages.cwi.nl/~storm/teaching/reader/Dijkstra68.pdf][potentially harmful]] and require discipline to use
   - Immobile :: Even though Python has a piece of the Embedded world, it doesn't correlate to a piece of the Mobile and Browser worlds

** Easter Eggs

   #+CAPTION: Part of a series on Why Python is BALLER
   #+NAME: 02-Baller
   #+BEGIN_EXAMPLE
   >>> from __future__ import braces
   >>> import __hello__
   >>> import this
   >>> import antigravity
   >>> antigravity.geohash(34.1688932, -118.3664655, b'2017-10-14-10458.68')
   34.000958 -118.465353
   >>> import webbrowser
   >>> webbrowser.open('http://032.la/')
   #+END_EXAMPLE

   - [[./02-Baller.html][Computer rendering of Why Python is BALLER]]
   - [[https://xkcd.com/353/][Artist rendering of Why Python is BALLER]]
   - [[https://docs.python.org/3/library/webbrowser.html][Python 3 webbrowser Module Documentation]]

* Literals, built-in types, and variables

  The [[https://docs.python.org/3/library/index.html#library-index][Python Standard Library]] contains a list of [[https://docs.python.org/3/library/constants.html][Built-in constants]], [[https://docs.python.org/3/library/stdtypes.html][Built-in Types]], and operators on those types.

  - Literal :: Literal representation of some *value* /i.e./ =7= is literally the number seven
  - Value :: some *type* of _thing_ we can contain as a concept and manipulate /i.e./ =7= plus =1= is the *value* =8=
  - Type :: Categorization or class of *values* that includes the representation and behavior for manipulation /i.e./ =7= and =8= are both a *type* of =number=, or =integer= that can be manipulated by arithmetic *operations*
  - Operation :: Some method of manipulating a *value* or *values* /i.e./ in =7 + 1= we use the =+= operator to =add= the *values*, combining them into a new larger value

