classes/programming-101-introduction-to-python/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>index</title>
<!-- 2017-12-07 Thu 23:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="merlin" />
</head>
<body>
<div id="content">
<h1 class="title">index</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Programming 101: Introduction to Python</a>
<ul>
<li><a href="#sec-1-1">1.1. How to Python</a></li>
<li><a href="#sec-1-2">1.2. Further resources</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Why Python is BALLER</a>
<ul>
<li><a href="#sec-2-1">2.1. Pros</a></li>
<li><a href="#sec-2-2">2.2. Neutral</a></li>
<li><a href="#sec-2-3">2.3. Cons</a></li>
<li><a href="#sec-2-4">2.4. Easter Eggs</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Literals, built-in types, and variables</a>
<ul>
<li><a href="#sec-3-1">3.1. Basic Calculator</a></li>
<li><a href="#sec-3-2">3.2. Built in Types</a></li>
<li><a href="#sec-3-3">3.3. Variables</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Functions, modules, and objects (briefly and shallowly)</a>
<ul>
<li><a href="#sec-4-1">4.1. Functions and Objects</a></li>
<li><a href="#sec-4-2">4.2. Modules</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Operators, loops, and conditionals</a></li>
<li><a href="#sec-6">6. Functions, modules, and objects (a bit deeper, as time permits)</a></li>
<li><a href="#sec-7">7. Adventure games</a>
<ul>
<li><a href="#sec-7-1">7.1. Datagram's Sweet Adventure</a></li>
<li><a href="#sec-7-2">7.2. Template Adventure</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Programming 101: Introduction to Python</h2>
<div class="outline-text-2" id="text-1">
<p>
Welcome to <b>NSL 3.0's</b> class <b>Programming 101: Introduction to Python</b> where you, the aspiring Python Hacker will watch, learn, and do in your quest to create.
</p>

<p>
This is a beginner's introduction but hopefully you at least have a copy of <a href="http://python.org/download/">Python</a> <b>version 3</b> available to you and an editor of some kind (for later).
</p>

<p>
This class is interactive and you should feel free to follow along in your own environments and ask questions whenever you need &#x2013; others probably have the same questions, so be brave!
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> How to Python</h3>
<div class="outline-text-3" id="text-1-1">
<p>
On most systems once you have Python installed you can start a <b>Python Shell</b> from any terminal or run bar by invoking <code>python</code>.  In some instances, this will open an <a href="https://docs.python.org/2/library/idle.html">IDLE</a> shell.
</p>

<pre class="example">
$ python3
Python 3.6.1 (default, Jul 13 2017, 01:14:50)
[GCC 4.2.1 Compatible FreeBSD Clang 3.4.1 (tags/RELEASE_34/dot1-final 208032)] on freebsd10
Type "help", "copyright", "credits" or "license" for more information.
&gt;&gt;&gt;
</pre>

<pre class="example">
PS C:\Users\merlin&gt; python
Python 3.6.1 (v3.6.1:69c0db5, Mar 21 2017, 18:41:36) [MSC v.1900 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license" for more information.
&gt;&gt;&gt;
</pre>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Further resources</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="http://docs.python.org/3/tutorial/">Python 3 Documentation: Tutorial</a>
</li>
<li><a href="https://docs.python.org/3/library/idle.html">Python 3 Documentation: IDLE</a>
</li>
<li><a href="http://www.codecademy.com/tracks/python">Python course at Codecademy</a>
</li>
<li><a href="http://learnpython.org">Python course at LearnPython</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Why Python is BALLER</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Pros</h3>
<div class="outline-text-3" id="text-2-1">
<dl class="org-dl">
<dt> Frontend to C </dt><dd>Almost all of the power of C without as many rituals or foot-guns &#x2013; unless you get into <b>CPython</b>, then you get it all
</dd>
<dt> Embedability </dt><dd>Almost everything can run Python since it is basically C underneath; <a href="https://www.raspberrypi.org/documentation/usage/python/">Raspberry-Pi</a> is famous for its Python integration
</dd>
<dt> Writeability </dt><dd>Easy to write most things with at least one obvious way to do anything
</dd>
<dt> Readability </dt><dd>Easy to read most code later, especially if it follows the <b>Zen of Python</b>
</dd>
<dt> Discoverability </dt><dd>Easy to learn about things within the language and online with tons of third party libraries
</dd>
<dt> Recyclability </dt><dd>Quick to keep iterating and refactoring upon ideas
</dd>
<dt> Portability </dt><dd>Same code works on quite a number of processor architectures and is available for quite a lot of operating systems
</dd>
<dt> Lingua Franca </dt><dd>People from many walks of life and domains of knowledge know and use Python
</dd>
<dt> Spider Python </dt><dd>Very Web friendly both as a consumer and a producer
</dd>
<dt> Prototyping </dt><dd>Quick to get started with just about anything thanks to all of the above
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Neutral</h3>
<div class="outline-text-3" id="text-2-2">
<dl class="org-dl">
<dt> No Braces </dt><dd>One less braceface in the world of programming
</dd>
<dt> BDFL </dt><dd><a href="https://gvanrossum.github.io">Guido Van Rossum</a>, <b>Benevolent Dictator For Life</b>
</dd>
<dt> Dynamic Ducks </dt><dd><a href="https://en.wikipedia.org/wiki/Type_system#Dynamic_type_checking_and_runtime_type_information">Dynamic Typing</a> lends itself to some of the <b>pros</b> <span class="underline">and</span> some of the <b>cons</b>, but it is just a fact of the language
</dd>
<dt> Static Stoics </dt><dd><a href="https://docs.python.org/3/library/typing.html">Type Hints</a> are available since <b>Python 3.5</b> and there is the <a href="http://mypy-lang.org">mypy static type checker</a>
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Cons</h3>
<div class="outline-text-3" id="text-2-3">
<dl class="org-dl">
<dt> FIOC </dt><dd>Forced Indentation of Code
</dd>
<dt> GIL </dt><dd><a href="https://wiki.python.org/moin/GlobalInterpreterLock">Global Interpreter Lock</a>
</dd>
<dt> <a href="http://benchmarksgame.alioth.debian.org/u64q/python.html">Expensive in Memory and CPU</a> </dt><dd>In part due to the above but also as a consequence of other language design and implementation choices
</dd>
<dt> Exceptional </dt><dd>Exceptions have some benefits but they are, ultimately, <a href="https://homepages.cwi.nl/~storm/teaching/reader/Dijkstra68.pdf">potentially harmful</a> and require discipline to use
</dd>
<dt> Immobile </dt><dd>Even though Python has a piece of the Embedded world, it doesn't correlate to a piece of the Mobile and Browser worlds
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Easter Eggs</h3>
<div class="outline-text-3" id="text-2-4">
<pre class="example">
&gt;&gt;&gt; from __future__ import braces
&gt;&gt;&gt; import __hello__
&gt;&gt;&gt; import this
&gt;&gt;&gt; import antigravity
&gt;&gt;&gt; antigravity.geohash(34.1688932, -118.3664655, b'2017-10-14-10458.68')
34.000958 -118.465353
&gt;&gt;&gt; import webbrowser
&gt;&gt;&gt; webbrowser.open('http://032.la/')
</pre>

<ul class="org-ul">
<li><a href="./02-Baller.html">Computer rendering of Why Python is BALLER</a>
</li>
<li><a href="https://xkcd.com/353/">Artist rendering of Why Python is BALLER</a>
</li>
<li><a href="https://docs.python.org/3/library/webbrowser.html">Python 3 webbrowser Module Documentation</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Literals, built-in types, and variables</h2>
<div class="outline-text-2" id="text-3">
<p>
The <a href="https://docs.python.org/3/library/index.html#library-index">Python Standard Library</a> contains a list of <a href="https://docs.python.org/3/library/constants.html">Built-in constants</a>, <a href="https://docs.python.org/3/library/stdtypes.html">Built-in Types</a>, and operators on those types.
</p>

<dl class="org-dl">
<dt> Literal </dt><dd>Literal representation of some <b>value</b> <i>i.e.</i> <code>7</code> is literally the number seven
</dd>
<dt> Value </dt><dd>some <b>type</b> of <span class="underline">thing</span> we can contain as a concept and manipulate <i>i.e.</i> <code>7</code> plus <code>1</code> is the <b>value</b> <code>8</code>
</dd>
<dt> Type </dt><dd>Categorization or class of <b>values</b> that includes the representation and behavior for manipulation <i>i.e.</i> <code>7</code> and <code>8</code> are both a <b>type</b> of <code>number</code>, or <code>integer</code> that can be manipulated by arithmetic <b>operations</b>
</dd>
<dt> Operation </dt><dd>Some method of manipulating a <b>value</b> or <b>values</b> <i>i.e.</i> in <code>7 + 1</code> we use the <code>+</code> operator to <code>add</code> the <b>values</b>, combining them into a new larger value
</dd>
</dl>
</div>
