classes/programming-101-introduction-to-python/index.org
** Basic Calculator

   #+CAPTION: Using Python as a basic calculator
   #+NAME: 03-Calculator
   #+BEGIN_EXAMPLE
   >>> 2 + 4
   >>> -2 - 7
   >>> 3 * 3
   >>> 3 ** 3
   >>> 8 / 2
   >>> 8 // 3
   >>> 3 / 10
   >>> 11 % 2
   >>> 713 ** 43
   >>> 1.34E-8 + 5.42E-8
   >>> (15 / 5 - 2)
   >>> (15 / 5) - 2
   >>> 15 / (5 - 2)
   #+END_EXAMPLE

   - [[./03-Calculator.html][Computer rendering of Using Python as a basic calculator]]

** Built in Types

   - Integers :: Whole or counting numbers
   - Floats :: Fractional values called *Floating* _decimal_ point values
   - NoneType :: A special type with a single value named =None=
   - Booleans :: Logical values =True= and =False=
   - Strings :: Ordered sequences (/aka/ *lists*) of (usually) *characters* in quote /i.e./ ='The quick brown fox jumped over the lazy dog'= is a string with every letter of the alphabet
   - Characters :: Fancy name for single letters (if only it were that simple) -- *Note:* this is not a separate type in Python, but it is in /C/
   - Lists :: Compound type that contains an ordered sequence of values of any type /i.e./ =[True, 'this is', 1, 'mixed bag']= is a list with several types of values inside it
   - Dictionaries :: Mappings (/aka/ _hashmaps_) of _key_ values to a single _data_ value /i.e./ ={'hack': 'the planet'}= /maps/ the *string* ='hack'= to the *string* ='the planet'=

   #+CAPTION: Using the Built in Types
   #+NAME: 03-Types
   #+BEGIN_EXAMPLE
   >>> 0.1 + 0.2
   >>> 6 / 0
   #+END_EXAMPLE

   - [[./03-Types.html][Computer rendering of Using the Built in Types]]


** Variables

   - Variable :: A name that is also a valid [[https://docs.python.org/3/reference/lexical_analysis.html#identifiers][identifier]] which references a mutable *value*, /i.e./ =x= and =y= are common variable names for numeric values but =income= and =expenses= are better names if applicable

   #+BEGIN_QUOTE
   There are only two hard things in Computer Science: cache invalidation and naming things.
   -- Phil Karlton
   #+END_QUOTE

   #+BEGIN_QUOTE
   There are 2 hard problems in computer science: cache invalidation, naming things, and off-by-1 errors.
   -- Leon Bambrick
   #+END_QUOTE

   #+CAPTION: Using Variables
   #+NAME: 03-Variables
   #+BEGIN_EXAMPLE
   >>> a, b, c = (1, 2, 3)
   #+END_EXAMPLE

   - [[./03-Variables.html][Computer rendering of Using Variables]]

* Functions, modules, and objects (briefly and shallowly)

  The [[https://docs.python.org/3/library/index.html#library-index][Python Standard Library]] contains a list of around =70= [[https://docs.python.org/3/library/functions.html][Built-in Functions]], well over =100= Built-in [[https://docs.python.org/3/tutorial/modules.html][modules]], and innumerable [[https://docs.python.org/3/tutorial/classes.html][Classes of Objects]] from those modules.

  - Function :: /in computer science/: A type of procedure or routine and /in mathematics/: a relation between a set of input values and a set of output values
  - Module :: A persistent collection of python variables, *functions*, and *objects* defined within a python file
  - Object :: Concept for some kind of *member* data and its behaviors separated into the abstract *class* and concrete *instance*
  - Class :: The abstract representation of a type /i.e./ a =hacker= is a type *class* of =people=
  - Instance :: The concrete representation of a specific *instance* of a *class of object* /i.e./ *you* are a =hacker=, and *I* am a =hacker=, but /we are not the same/ =hacker=
  - Member :: Data or functions attached to a class /i.e./ 'member when your birthday happened?  Your age data *member* increased by a value of =1=
  - Method :: A member function is often referred to as a method /i.e./ use your =hack_harder= *method* if any of this is confusing to you

** Functions and Objects

   # TODO: Update with latest from notebook
   #+CAPTION: Using Functions and Objects
   #+NAME: 04-Funjects
   #+BEGIN_EXAMPLE
   >>> f = 2x + 2
   >>> f = lambda x: (2 * x) + 2
   >>> f
   >>> f(0)
   >>> f(1)
   >>> f(23)
   >>> def double(x):
           return x * 2
   >>> def square(x):
           return x * x
   >>> double
   >>> square
   >>> help(square)
   >>> double(5)
   >>> square(5)
   >>> type(1)
   >>> type(1.2)
   >>> type('nsl')
   >>> id(1)
   >>> x = 1
   >>> id(x) == id(1)
   >>> seq = []
   >>> len(seq)
   >>> dir(seq)
   >>> seq.append(2)
   >>> seq.append(1)
   >>> seq.append(3)
   >>> len(seq)
   >>> seq
   >>> seq.index(2)
   >>> seq[1] == seq[seq.index(2)]
   >>> seq.sort()
   >>> seq
   #+END_EXAMPLE

   - [[./04-Funjects.html][Computer rendering of Using Functions and Objects]]

** Modules

   If you end your python shell session, all the variables and functions you defined will be lost.  That simply won't do!

   #+CAPTION: maths module
   #+NAME: maths
   #+BEGIN_SRC python
'''Simple circle maths module in terms of tau where simplest'''

from math import pi


def double(x):
    '''Return twice the value given.'''
    return x * 2

tau = double(pi)


def square(x):
    '''Return the square of the value given.'''
    return x * x


def diameter(radius):
    '''Return the diameter of a circle given the radius.'''
    return double(radius)


def circumfrence(radius):
    '''Return the circumfrence of a circle given the radius.'''
    return tau * radius


def area(radius):
    '''Return the area of a circle given the radius.'''
    return pi * square(radius)
   #+END_SRC

   #+CAPTION: Using the circle.py module
   #+NAME: 04-Cirque
   #+BEGIN_EXAMPLE
   >>> import circle
   >>> circle.pi
   >>> circle.tau
   >>> circle.area(2)
   >>> circle.circumfrence(2)
   >>> circle.area(10)
   >>> circle.circumfrence(10)
   #+END_EXAMPLE

   - [[./04-Cirque.html][Computer rendering of Using the circle.py module]]

* Operators, loops, and conditionals

  #+CAPTION: Using operators, conditionals, and loops
  #+NAME: Operloopditionals
  #+BEGIN_SRC python

  #+END_SRC

  - [[./06-Operloopditionals.html][Computer rendering of Using operators, conditionals, and loops]]

* Functions, modules, and objects (a bit deeper, as time permits)


  #+CAPTION: Going deeper with functions, modules, and objects
  #+NAME: Funky
  #+BEGIN_SRC python

  #+END_SRC

  - [[./07-Funky.html][Computer rendering of Going deeper with functions, modules, and objects]]


* Adventure games

