classes/programming-101-introduction-to-python/index.html

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Basic Calculator</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
&gt;&gt;&gt; 2 + 4
&gt;&gt;&gt; -2 - 7
&gt;&gt;&gt; 3 * 3
&gt;&gt;&gt; 3 ** 3
&gt;&gt;&gt; 8 / 2
&gt;&gt;&gt; 8 // 3
&gt;&gt;&gt; 3 / 10
&gt;&gt;&gt; 11 % 2
&gt;&gt;&gt; 713 ** 43
&gt;&gt;&gt; 1.34E-8 + 5.42E-8
&gt;&gt;&gt; (15 / 5 - 2)
&gt;&gt;&gt; (15 / 5) - 2
&gt;&gt;&gt; 15 / (5 - 2)
</pre>

<ul class="org-ul">
<li><a href="./03-Calculator.html">Computer rendering of Using Python as a basic calculator</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Built in Types</h3>
<div class="outline-text-3" id="text-3-2">
<dl class="org-dl">
<dt> Integers </dt><dd>Whole or counting numbers
</dd>
<dt> Floats </dt><dd>Fractional values called <b>Floating</b> <span class="underline">decimal</span> point values
</dd>
<dt> NoneType </dt><dd>A special type with a single value named <code>None</code>
</dd>
<dt> Booleans </dt><dd>Logical values <code>True</code> and <code>False</code>
</dd>
<dt> Strings </dt><dd>Ordered sequences (<i>aka</i> <b>lists</b>) of (usually) <b>characters</b> in quote <i>i.e.</i> ='The quick brown fox jumped over the lazy dog'= is a string with every letter of the alphabet
</dd>
<dt> Characters </dt><dd>Fancy name for single letters (if only it were that simple) &#x2013; <b>Note:</b> this is not a separate type in Python, but it is in <i>C</i>
</dd>
<dt> Lists </dt><dd>Compound type that contains an ordered sequence of values of any type <i>i.e.</i> <code>[True, 'this is', 1, 'mixed bag']</code> is a list with several types of values inside it
</dd>
<dt> Dictionaries </dt><dd>Mappings (<i>aka</i> <span class="underline">hashmaps</span>) of <span class="underline">key</span> values to a single <span class="underline">data</span> value <i>i.e.</i> <code>{'hack': 'the planet'}</code> <i>maps</i> the <b>string</b> ='hack'= to the <b>string</b> ='the planet'=
</dd>
</dl>

<pre class="example">
&gt;&gt;&gt; 0.1 + 0.2
&gt;&gt;&gt; 6 / 0
</pre>

<ul class="org-ul">
<li><a href="./03-Types.html">Computer rendering of Using the Built in Types</a>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Variables</h3>
<div class="outline-text-3" id="text-3-3">
<dl class="org-dl">
<dt> Variable </dt><dd>A name that is also a valid <a href="https://docs.python.org/3/reference/lexical_analysis.html#identifiers">identifier</a> which references a mutable <b>value</b>, <i>i.e.</i> <code>x</code> and <code>y</code> are common variable names for numeric values but <code>income</code> and <code>expenses</code> are better names if applicable
</dd>
</dl>

<blockquote>
<p>
There are only two hard things in Computer Science: cache invalidation and naming things.
&#x2013; Phil Karlton
</p>
</blockquote>

<blockquote>
<p>
There are 2 hard problems in computer science: cache invalidation, naming things, and off-by-1 errors.
&#x2013; Leon Bambrick
</p>
</blockquote>

<pre class="example">
&gt;&gt;&gt; a, b, c = (1, 2, 3)
</pre>

<ul class="org-ul">
<li><a href="./03-Variables.html">Computer rendering of Using Variables</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Functions, modules, and objects (briefly and shallowly)</h2>
<div class="outline-text-2" id="text-4">
<p>
The <a href="https://docs.python.org/3/library/index.html#library-index">Python Standard Library</a> contains a list of around <code>70</code> <a href="https://docs.python.org/3/library/functions.html">Built-in Functions</a>, well over <code>100</code> Built-in <a href="https://docs.python.org/3/tutorial/modules.html">modules</a>, and innumerable <a href="https://docs.python.org/3/tutorial/classes.html">Classes of Objects</a> from those modules.
</p>

<dl class="org-dl">
<dt> Function </dt><dd><i>in computer science</i>: A type of procedure or routine and <i>in mathematics</i>: a relation between a set of input values and a set of output values
</dd>
<dt> Module </dt><dd>A persistent collection of python variables, <b>functions</b>, and <b>objects</b> defined within a python file
</dd>
<dt> Object </dt><dd>Concept for some kind of <b>member</b> data and its behaviors separated into the abstract <b>class</b> and concrete <b>instance</b>
</dd>
<dt> Class </dt><dd>The abstract representation of a type <i>i.e.</i> a <code>hacker</code> is a type <b>class</b> of <code>people</code>
</dd>
<dt> Instance </dt><dd>The concrete representation of a specific <b>instance</b> of a <b>class of object</b> <i>i.e.</i> <b>you</b> are a <code>hacker</code>, and <b>I</b> am a <code>hacker</code>, but <i>we are not the same</i> <code>hacker</code>
</dd>
<dt> Member </dt><dd>Data or functions attached to a class <i>i.e.</i> 'member when your birthday happened?  Your age data <b>member</b> increased by a value of <code>1</code>
</dd>
<dt> Method </dt><dd>A member function is often referred to as a method <i>i.e.</i> use your <code>hack_harder</code> <b>method</b> if any of this is confusing to you
</dd>
</dl>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Functions and Objects</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example">
&gt;&gt;&gt; f = 2x + 2
&gt;&gt;&gt; f = lambda x: (2 * x) + 2
&gt;&gt;&gt; f
&gt;&gt;&gt; f(0)
&gt;&gt;&gt; f(1)
&gt;&gt;&gt; f(23)
&gt;&gt;&gt; def double(x):
        return x * 2
&gt;&gt;&gt; def square(x):
        return x * x
&gt;&gt;&gt; double
&gt;&gt;&gt; square
&gt;&gt;&gt; help(square)
&gt;&gt;&gt; double(5)
&gt;&gt;&gt; square(5)
&gt;&gt;&gt; type(1)
&gt;&gt;&gt; type(1.2)
&gt;&gt;&gt; type('nsl')
&gt;&gt;&gt; id(1)
&gt;&gt;&gt; x = 1
&gt;&gt;&gt; id(x) == id(1)
&gt;&gt;&gt; seq = []
&gt;&gt;&gt; len(seq)
&gt;&gt;&gt; dir(seq)
&gt;&gt;&gt; seq.append(2)
&gt;&gt;&gt; seq.append(1)
&gt;&gt;&gt; seq.append(3)
&gt;&gt;&gt; len(seq)
&gt;&gt;&gt; seq
&gt;&gt;&gt; seq.index(2)
&gt;&gt;&gt; seq[1] == seq[seq.index(2)]
&gt;&gt;&gt; seq.sort()
&gt;&gt;&gt; seq
</pre>

<ul class="org-ul">
<li><a href="./04-Funjects.html">Computer rendering of Using Functions and Objects</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Modules</h3>
<div class="outline-text-3" id="text-4-2">
<p>
If you end your python shell session, all the variables and functions you defined will be lost.  That simply won't do!
</p>

<div class="org-src-container">
<label class="org-src-name">maths module</label>
<pre class="src src-python" id="maths">'''Simple circle maths module in terms of tau where simplest'''

from math import pi


def double(x):
    '''Return twice the value given.'''
    return x * 2

tau = double(pi)


def square(x):
    '''Return the square of the value given.'''
    return x * x


def diameter(radius):
    '''Return the diameter of a circle given the radius.'''
    return double(radius)


def circumfrence(radius):
    '''Return the circumfrence of a circle given the radius.'''
    return tau * radius


def area(radius):
    '''Return the area of a circle given the radius.'''
    return pi * square(radius)
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; import circle
&gt;&gt;&gt; circle.pi
&gt;&gt;&gt; circle.tau
&gt;&gt;&gt; circle.area(2)
&gt;&gt;&gt; circle.circumfrence(2)
&gt;&gt;&gt; circle.area(10)
&gt;&gt;&gt; circle.circumfrence(10)
</pre>

<ul class="org-ul">
<li><a href="./04-Cirque.html">Computer rendering of Using the circle.py module</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Operators, loops, and conditionals</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<label class="org-src-name">Using operators, conditionals, and loops</label>
<pre class="src src-python" id="Operloopditionals"></pre>
</div>

<ul class="org-ul">
<li><a href="./06-Operloopditionals.html">Computer rendering of Using operators, conditionals, and loops</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Functions, modules, and objects (a bit deeper, as time permits)</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<label class="org-src-name">Going deeper with functions, modules, and objects</label>
<pre class="src src-python" id="Funky"></pre>
</div>

<ul class="org-ul">
<li><a href="./07-Funky.html">Computer rendering of Going deeper with functions, modules, and objects</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Adventure games</h2>
