classes/programming-101-introduction-to-python/index.html
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Datagram's Sweet Adventure</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Ported to Python3 by Merlin with love!
</p>

<div class="org-src-container">
<label class="org-src-name">Datagram's Sweet Adventure Game</label>
<pre class="src src-python" id="08-Dataventure">print('=' * 30)
print('Welcome to my Awesome Program!')
print('=' * 30)

print()
a = input('What is your name? ')
print('Your name is: {}'.format(a))
print()
b = input('Are you ready for an adventure? ')
print()
if 'yes' == b.lower():
    print('ADVENTURE TIME\n' * 5)
else:
    print('FINE BE THAT WAY')
</pre>
</div>

<ul class="org-ul">
<li><a href="https://repl.it/@merlincorey/nsl-python-101-introduction-adventure-start-datagram">repl.it Datagram's Adventure Game</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Template Adventure</h3>
<div class="outline-text-3" id="text-7-2">
<p>
If you can't wait to get adventuring but aren't quite sure where to start, here's an example template to get you going:
</p>

<div class="org-src-container">
<label class="org-src-name">Adventure Game Template</label>
<pre class="src src-python" id="adventure.py">'''Adventure game by INSERTYOURNAMEHERE.

INSERTDESCRIPTIONHERE

ANDHERE TOO
'''

import sys


def adventure():
    '''Play the adventure, reading from standard input and writing to standard output.'''

    rooms = {'lab': 'A bright and messy labratory.',
             'toilet': 'A dark and clean toilet.'}
    room = 'lab'

    name = input('Welcome traveler!  What be yer name? ')
    print('That is a strange name, {}, but I like it.'.format(name))

    living = True
    winning = False
    while living and not winning:
        print('You are in the {}'.format(room))
        print(rooms[room])
        action = input('What will {} do?\n&gt; '.format(name)).strip().lower()

        if 'die' == action:
            print('Suddenly, you do not feel so good.  Maybe you should lie down.')
            living = False
        elif 'north' == action:
            if 'lab' == room:
                room = 'toilet'
        elif 'south' == action:
            if 'toilet' == room:
                room = 'lab'
        elif 'sleep' == action:
            print('You feel fine, no need to sleep.')
        else:
            print('Not sure what you meant by that, boss.')


    if living:
        print('You made it out alive, {}!'.format(name))
    else:
        print('Sorry, {}, but you are DEAD!'.format(name))

    if winning:
        print('I am not sure how, but you also managed to win!  Great job!')


def main(argv):
    '''Return exit code as integer, receives commandline arguments as list of strings, runs Adventure in between.'''
    adventure()
    return 0

if '__main__' == __name__:
    sys.exit(main(sys.argv))
</pre>
</div>

<ul class="org-ul">
<li><a href="./adventure.py">Download adventure.py</a>
</li>
<li><a href="https://repl.it/@merlincorey/nsl-python-101-introduction-adventure-template-merlin">repl.it Merlin's Adventure Game</a>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: merlin</p>
<p class="date">Created: 2017-12-07 Thu 23:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
